lhzloveyyj/FOC/stm32f103_FOC/电流环/.pack/Keil/STM32F1xx_DFP.2.3.0/RTE_Driver/SPI_STM32F10x.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2015 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        26. October 2015
 * $Revision:    V2.2
 *
 * Driver:       Driver_SPI1, Driver_SPI2, Driver_SPI3
 * Configured:   via RTE_Device.h configuration file
 * Project:      SPI Driver for STMicroelectronics STM32F10x
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value   SPI Interface
 *   ---------------------                 -----   -------------
 *   Connect to hardware via Driver_SPI# = 1       use SPI1
 *   Connect to hardware via Driver_SPI# = 2       use SPI2
 *   Connect to hardware via Driver_SPI# = 3       use SPI3
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 2.2
 *    Corrected SPI Peripheral Reset and Clock enable/disable
 *      - Added checking if peripheral is available on selected device
 *  Version 2.1
 *    Corrected Bus Speed configuration
 *    Corrected 8bit/16bit Data register access, regarding the Data frame size
 *  Version 2.0
 *    Updated to CMSIS Driver API V2.01
 *  Version 1.3
 *    Event send_data_event added to capabilities
 *    SPI IRQ handling corrected
 *  Version 1.2
 *    Based on API V1.10 (namespace prefix ARM_ added)
 *  Version 1.1
 *    Corrections for configuration without DMA
 *  Version 1.0
 *    Initial release
 */

#include "SPI_STM32F10x.h"

#define ARM_SPI_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(2,2)

// Driver Version
static const ARM_DRIVER_VERSION DriverVersion = { ARM_SPI_API_VERSION, ARM_SPI_DRV_VERSION };

// Driver Capabilities
static const ARM_SPI_CAPABILITIES DriverCapabilities = {
  0,  /* Simplex Mode (Master and Slave) */
  0,  /* TI Synchronous Serial Interface */
  0,  /* Microwire Interface */
  1   /* Signal Mode Fault event: \ref ARM_SPI_EVENT_MODE_FAULT */
};


#ifdef MX_SPI1

// SPI1 Run-Time Information
static SPI_INFO          SPI1_Info         = { 0U };
static SPI_TRANSFER_INFO SPI1_TransferInfo = { 0U };

#ifdef MX_SPI1_MOSI_Pin
  static SPI_PIN SPI1_mosi = {MX_SPI1_MOSI_GPIOx, MX_SPI1_MOSI_GPIO_Pin};
#endif
#ifdef MX_SPI1_MISO_Pin
  static SPI_PIN SPI1_miso = {MX_SPI1_MISO_GPIOx, MX_SPI1_MISO_GPIO_Pin};
#endif
#ifdef MX_SPI1_NSS_Pin
  static SPI_PIN SPI1_nss  = {MX_SPI1_NSS_GPIOx,  MX_SPI1_NSS_GPIO_Pin};
#endif
  static SPI_PIN SPI1_sck  = {MX_SPI1_SCK_GPIOx,  MX_SPI1_SCK_GPIO_Pin};


#ifdef MX_SPI1_RX_DMA_Instance
static SPI_DMA SPI1_DMA_Rx = {
  MX_SPI1_RX_DMA_Instance,
  MX_SPI1_RX_DMA_Number,
  MX_SPI1_RX_DMA_Channel,
  MX_SPI1_RX_DMA_Priority
};
#endif

#ifdef MX_SPI1_TX_DMA_Instance
static SPI_DMA SPI1_DMA_Tx = {
  MX_SPI1_TX_DMA_Instance,
  MX_SPI1_TX_DMA_Number,
  MX_SPI1_TX_DMA_Channel,
  MX_SPI1_TX_DMA_Priority
};
#endif

// SPI1 Resources
static const SPI_RESOURCES SPI1_Resources = {
  SPI1,
  RTE_PCLK2,
  // PINS
  {
#ifdef MX_SPI1_MOSI_Pin
    &SPI1_mosi,
#else
    NULL,
#endif
#ifdef MX_SPI1_MISO_Pin
    &SPI1_miso,
#else
    NULL,
#endif
#ifdef MX_SPI1_NSS_Pin 
    &SPI1_nss,
#else
    NULL,
#endif
    &SPI1_sck,
    MX_SPI1_REMAP_DEF,
    MX_SPI1_REMAP
  },

  SPI1_IRQn,

#ifdef MX_SPI1_RX_DMA_Instance
  &SPI1_DMA_Rx,
#else
  NULL,
#endif

#ifdef MX_SPI1_TX_DMA_Instance
  &SPI1_DMA_Tx,
#else
  NULL,
#endif

  &SPI1_Info,
  &SPI1_TransferInfo
};
#endif /* MX_SPI1 */

#ifdef MX_SPI2

// SPI2 Run-Time Information
static SPI_INFO          SPI2_Info         = { 0U };
static SPI_TRANSFER_INFO SPI2_TransferInfo = { 0U };


#ifdef MX_SPI2_MOSI_Pin
  static SPI_PIN SPI2_mosi = {MX_SPI2_MOSI_GPIOx, MX_SPI2_MOSI_GPIO_Pin};
#endif
#ifdef MX_SPI2_MISO_Pin
  static SPI_PIN SPI2_miso = {MX_SPI2_MISO_GPIOx, MX_SPI2_MISO_GPIO_Pin};
#endif
#ifdef MX_SPI2_NSS_Pin
  static SPI_PIN SPI2_nss  = {MX_SPI2_NSS_GPIOx,  MX_SPI2_NSS_GPIO_Pin};
#endif
  static SPI_PIN SPI2_sck  = {MX_SPI2_SCK_GPIOx,  MX_SPI2_SCK_GPIO_Pin};

#ifdef MX_SPI2_RX_DMA_Instance
static SPI_DMA SPI2_DMA_Rx = {
  MX_SPI2_RX_DMA_Instance,
  MX_SPI2_RX_DMA_Number,
  MX_SPI2_RX_DMA_Channel,
  MX_SPI2_RX_DMA_Priority
};
#endif
#ifdef MX_SPI2_TX_DMA_Instance
static SPI_DMA SPI2_DMA_Tx = {
  MX_SPI2_TX_DMA_Instance,
  MX_SPI2_TX_DMA_Number,
  MX_SPI2_TX_DMA_Channel,
  MX_SPI2_TX_DMA_Priority
};
#endif

// SPI2 Resources
static const SPI_RESOURCES SPI2_Resources = {
  SPI2,
  RTE_PCLK1,
  // PINS
  {
#ifdef MX_SPI2_MOSI_Pin
    &SPI2_mosi,
#else
    NULL,
#endif
#ifdef MX_SPI2_MISO_Pin
    &SPI2_miso,
#else
    NULL,
#endif
#ifdef MX_SPI2_NSS_Pin 
    &SPI2_nss,
#else
    NULL,
#endif
    &SPI2_sck,
    MX_SPI2_REMAP_DEF,
    MX_SPI2_REMAP
  },

  SPI2_IRQn,

#ifdef MX_SPI2_RX_DMA_Instance
  &SPI2_DMA_Rx,
#else
  NULL,
#endif

#ifdef MX_SPI2_TX_DMA_Instance
  &SPI2_DMA_Tx,
#else
  NULL,
#endif

  &SPI2_Info,
  &SPI2_TransferInfo
};
#endif /* MX_SPI2 */

#ifdef MX_SPI3

// SPI3 Run-Time Information
static SPI_INFO          SPI3_Info         = { 0U };
static SPI_TRANSFER_INFO SPI3_TransferInfo = { 0U };


#ifdef MX_SPI3_MOSI_Pin
  static SPI_PIN SPI3_mosi = {MX_SPI3_MOSI_GPIOx, MX_SPI3_MOSI_GPIO_Pin};
#endif
#ifdef MX_SPI3_MISO_Pin
  static SPI_PIN SPI3_miso = {MX_SPI3_MISO_GPIOx, MX_SPI3_MISO_GPIO_Pin};
#endif
#ifdef MX_SPI3_NSS_Pin
  static SPI_PIN SPI3_nss  = {MX_SPI3_NSS_GPIOx,  MX_SPI3_NSS_GPIO_Pin};
#endif
  static SPI_PIN SPI3_sck  = {MX_SPI3_SCK_GPIOx,  MX_SPI3_SCK_GPIO_Pin};

#ifdef MX_SPI3_RX_DMA_Instance
static SPI_DMA SPI3_DMA_Rx = {
  MX_SPI3_RX_DMA_Instance,
  MX_SPI3_RX_DMA_Number,
  MX_SPI3_RX_DMA_Channel,
  MX_SPI3_RX_DMA_Priority
};
#endif
#ifdef MX_SPI3_TX_DMA_Instance
static SPI_DMA SPI3_DMA_Tx = {
  MX_SPI3_TX_DMA_Instance,
  MX_SPI3_TX_DMA_Number,
  MX_SPI3_TX_DMA_Channel,
  MX_SPI3_TX_DMA_Priority
  };
#endif

// SPI3 Resources
static const SPI_RESOURCES SPI3_Resources = {
  SPI3,
  RTE_PCLK1,
  // PINS
  {
#ifdef MX_SPI3_MOSI_Pin
    &SPI3_mosi,
#else
    NULL,
#endif
#ifdef MX_SPI3_MISO_Pin
    &SPI3_miso,
#else
    NULL,
#endif
#ifdef MX_SPI3_NSS_Pin 
    &SPI3_nss,
#else
    NULL,
#endif
    &SPI3_sck,
    MX_SPI3_REMAP_DEF,
    MX_SPI3_REMAP
  },

