lhzloveyyj/FOC/stm32f103_FOC/电流环/.pack/Keil/STM32F1xx_DFP.2.3.0/RTE_Driver/SPI_STM32F10x.c
  if ((mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_INACTIVE) {
    spi->info->state &= ~SPI_CONFIGURED;
  } else {
    spi->info->state |=  SPI_CONFIGURED;
  }

  // Enable SPI
  spi->reg->CR1 |= SPI_CR1_SPE;

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_SPI_STATUS SPI_GetStatus (const SPI_RESOURCES *spi)
  \brief       Get SPI status.
  \param[in]   spi  Pointer to SPI resources
  \return      SPI status \ref ARM_SPI_STATUS
*/
static ARM_SPI_STATUS SPI_GetStatus (const SPI_RESOURCES *spi) {
  ARM_SPI_STATUS status;

  status.busy       = spi->info->status.busy;
  status.data_lost  = spi->info->status.data_lost;
  status.mode_fault = spi->info->status.mode_fault;

  return status;
}

/*SPI IRQ Handler */
void SPI_IRQHandler (const SPI_RESOURCES *spi) {
  uint8_t  data_8bit;
  uint16_t data_16bit, sr;
  uint32_t event;

  // Save status register
  sr = spi->reg->SR;

  event = 0U;

  if ((sr & SPI_SR_OVR) != 0U) {
    // Clear Overrun flag by reading data and status register
    if ((spi->reg->CR1 & SPI_CR1_DFF) == 0U) {
      // 8-bit data frame
      data_8bit = *(volatile uint8_t *)(&spi->reg->DR);
      if (spi->xfer->rx_cnt < spi->xfer->num) {
        if (spi->xfer->rx_buf != NULL) {
          *(spi->xfer->rx_buf++) = data_8bit;
        }
      }
    } else {
      // 16-bit data frame
      data_16bit = *(volatile uint16_t *)(&spi->reg->DR);
      if (spi->xfer->rx_cnt < spi->xfer->num) {
        if (spi->xfer->rx_buf != NULL) {
          *(spi->xfer->rx_buf++) = (uint8_t) data_16bit;
          *(spi->xfer->rx_buf++) = (uint8_t)(data_16bit >> 8U);
        }
      }
    }
    spi->xfer->rx_cnt++;
    sr = spi->reg->SR;

    spi->info->status.data_lost = 1U;
    event |=ARM_SPI_EVENT_DATA_LOST;
  }
  if ((sr & SPI_SR_UDR) != 0U) {
    // Underrun flag is set
    spi->info->status.data_lost = 1U;
    event |= ARM_SPI_EVENT_DATA_LOST;
  }
  if ((sr & SPI_SR_MODF) != 0U) {
    // Mode fault flag is set
    spi->info->status.mode_fault = 1U;

    // Write CR1 register to clear MODF flag
    spi->reg->CR1 = spi->reg->CR1;
    event |= ARM_SPI_EVENT_MODE_FAULT;
  }

  if (((sr & SPI_SR_RXNE) != 0U) && ((spi->reg->CR2 & SPI_CR2_RXNEIE) != 0U)) {
    // Receive Buffer Not Empty

    if (spi->xfer->rx_cnt < spi->xfer->num) {
      if ((spi->reg->CR1 & SPI_CR1_DFF) == 0U) {
        // 8-bit data frame
        data_8bit = *(volatile uint8_t *)(&spi->reg->DR);
        if (spi->xfer->rx_buf != NULL) {
          *(spi->xfer->rx_buf++) = data_8bit;
        }
      } else {
        // 16-bit data frame
        data_16bit = *(volatile uint16_t *)(&spi->reg->DR);
        if (spi->xfer->rx_buf != NULL) {
          *(spi->xfer->rx_buf++) = (uint8_t) data_16bit;
          *(spi->xfer->rx_buf++) = (uint8_t)(data_16bit >> 8U);
        }
      }

      spi->xfer->rx_cnt++;

      if (spi->xfer->rx_cnt == spi->xfer->num) {

        // Disable RX Buffer Not Empty Interrupt
        spi->reg->CR2 &= ~SPI_CR2_RXNEIE;

        // Clear busy flag
        spi->info->status.busy = 0U;

        // Transfer completed
        event |= ARM_SPI_EVENT_TRANSFER_COMPLETE;
      }
    }
    else {
      // Unexpected transfer, data lost
      event |= ARM_SPI_EVENT_DATA_LOST;
    }
  }

  if (((sr & SPI_SR_TXE) != 0U) && ((spi->reg->CR2 & SPI_CR2_TXEIE) != 0U)) {
    if (spi->xfer->tx_cnt < spi->xfer->num) {
      if ((spi->reg->CR1 & SPI_CR1_DFF) == 0U) {
        if (spi->xfer->tx_buf != NULL) {
          data_8bit = *(spi->xfer->tx_buf++);
        } else {
          data_8bit = (uint8_t)spi->xfer->def_val;
        }
        // Write data to data register
        *(volatile uint8_t *)(&spi->reg->DR) = data_8bit;
      } else {
        if (spi->xfer->tx_buf != NULL) {
          data_16bit  = *(spi->xfer->tx_buf++);
          data_16bit |= *(spi->xfer->tx_buf++) << 8U;
        } else {
          data_16bit  = (uint16_t)spi->xfer->def_val;
        }
        // Write data to data register
        *(volatile uint16_t *)(&spi->reg->DR) = data_16bit;
      }

      spi->xfer->tx_cnt++;

      if (spi->xfer->tx_cnt == spi->xfer->num) {
        // All data sent, disable TX Buffer Empty Interrupt
        spi->reg->CR2 &= ~SPI_CR2_TXEIE;
      }
    } else {
      // Unexpected transfer, data lost
      event |= ARM_SPI_EVENT_DATA_LOST;
    }
  }

  // Send event
  if ((event != 0U) && ((spi->info->cb_event != NULL))) {
    spi->info->cb_event(event);
  }
}

#ifdef __SPI_DMA_TX
void SPI_TX_DMA_Complete(uint32_t events, const SPI_RESOURCES *spi) {

  DMA_ChannelDisable(spi->tx_dma->instance);
  
  if ((DMA_ChannelTransferItemCount(spi->tx_dma->instance) != 0) && (spi->xfer->num != 0)) {
    // TX DMA Complete caused by transfer abort
    return;
  }

  spi->xfer->tx_cnt = spi->xfer->num;
}
#endif

#ifdef __SPI_DMA_RX
void SPI_RX_DMA_Complete(uint32_t events, const SPI_RESOURCES *spi) {

  DMA_ChannelDisable(spi->rx_dma->instance);

  if ((DMA_ChannelTransferItemCount(spi->rx_dma->instance) != 0) && (spi->xfer->num != 0)) {
    // RX DMA Complete caused by transfer abort
    return;
  }

  spi->xfer->rx_cnt = spi->xfer->num;

  spi->info->status.busy = 0U;
  if (spi->info->cb_event != NULL) {
    spi->info->cb_event(ARM_SPI_EVENT_TRANSFER_COMPLETE);
  }
}
#endif

// SPI1
#ifdef MX_SPI1
static int32_t        SPI1_Initialize          (ARM_SPI_SignalEvent_t pSignalEvent)                { return SPI_Initialize (pSignalEvent, &SPI1_Resources); }
static int32_t        SPI1_Uninitialize        (void)                                              { return SPI_Uninitialize (&SPI1_Resources); }
static int32_t        SPI1_PowerControl        (ARM_POWER_STATE state)                             { return SPI_PowerControl (state, &SPI1_Resources); }
static int32_t        SPI1_Send                (const void *data, uint32_t num)                    { return SPI_Send (data, num, &SPI1_Resources); }
static int32_t        SPI1_Receive             (void *data, uint32_t num)                          { return SPI_Receive (data, num, &SPI1_Resources); }
static int32_t        SPI1_Transfer            (const void *data_out, void *data_in, uint32_t num) { return SPI_Transfer (data_out, data_in, num, &SPI1_Resources); }
static uint32_t       SPI1_GetDataCount        (void)                                              { return SPI_GetDataCount (&SPI1_Resources); }
static int32_t        SPI1_Control             (uint32_t control, uint32_t arg)                    { return SPI_Control (control, arg, &SPI1_Resources); }
static ARM_SPI_STATUS SPI1_GetStatus           (void)                                              { return SPI_GetStatus (&SPI1_Resources); }
       void           SPI1_IRQHandler          (void)                                              {        SPI_IRQHandler (&SPI1_Resources); }

